Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/irish_citizenship/becoming_an_irish_citizen_through_naturalisation.html.txt.tmx
Source language: en
Languages: ga

source: Becoming an Irish citizen through naturalisation
ga: Ag éirí i do shaoránach de chuid na hÉireann trí eadóirseacht

source: Naturalisation means the process whereby a foreign national living in Ireland may apply to become an Irish citizen
ga: Is éard a chiallaíonn eadóirseacht ná an próiseas trínar féidir le náisiúnach eachtrannach ar a bhfuil cónaí in Éirinn iarratas a dhéanamh chun saoránacht Éireannach a bhaint amach

source: In order to apply for naturalisation in Ireland, you must have been physically resident in Ireland for a certain length of time
ga: Chun iarratas a dhéanamh ar eadóirseacht in Éirinn, ní mór duit gnáthchónaí fisiciúil a bheith ort in Éirinn ar feadh tréimhse áirithe ama

source: All applications to become a naturalised Irish citizen are decided by the Minister for Justice and Equality
ga: Is é an tAire Dlí agus Cirt agus Comhionannais a dhéanann cinneadh maidir le gach iarratas ar eadóirseacht mar shaoránach Éireannach

source: This Minister has absolute discretion as to whether or not to grant naturalisation
ga: Tá discréid absalóideach ag an Aire maidir le cé acu an ndeonfar nó nach ndeonfar d'iarratas ar eadóirseacht

source: There are strict rules about applying for naturalisation as an Irish citizen and these rules are set out below
ga: Tá rialacha diana ann faoi iarratas a dhéanamh ar eadóirseacht mar shaoránach Éireannach agus tá na rialacha seo leagtha amach thíos

source: You must use the current versions of the application forms on the INIS website - see 'How to apply' below
ga: Caithfidh tú leagan reatha na foirmeacha iarratais ar fáil ar an suíomh gréasáin SEIS a úsáid – féach ‘Conas iarratas a dhéanamh’ thíos

source: There is an application fee of €175 - see 'Rates' below
ga: Tá táille €175– féach ‘Rátaí’ thíos

source: Public Services Card: Since 19 September 2016, if you are applying for naturalisation and you are resident in the State, you must be registered with the Department of Social Protection for a Public Services Card
ga: Cárta Seirbhísí Poiblí: Ó 19 Meán Fómhair 2016, má dhéanann tú iarratas ar eadóirseacht agus tá tú i do chónaí sa Stát, ní mór duit bheith cláraithe leis an Roinn Coimirce Sóisialaí do Chárta Seirbhísí Poiblí

source: Who is eligible for naturalisation?
ga: Cé atá i dteideal eadóirseachta?

source: If you wish to become an Irish citizen through naturalisation, you must:
ga: Más mian leat a bheith i do shaoránach Éireannach trí eadóirseacht, caithfidh tú:

source: • Be 18 years or older (you must be married if you are under the age of 18) or,
ga: • A bheith 18 nó os a chionn (caithfidh tú bheith pósta má tá tú níos óige na 18) nó,

source: • Be a minor born in the State (from 1 January 2005) and
ga: • A bheith i do mhionaoiseach a rugadh sa Stát (ón 1 Eanáir 2005) agus

source: • Be of good character - the Garda Síochána (Ireland's national police) will be asked to provide a report about your background
ga: • Caithfidh dea-cháil a bheith ort - iarrfar ar an nGarda Síochána (póilíní náisiúnta na hÉireann) tuairisc a thabhairt ar do chúlra

source: Any criminal record or ongoing proceedings will be taken into consideration by the Minister for Justice and Equality in deciding whether or not to grant naturalisation
ga: Déanfaidh an tAire Dlí agus Cirt agus Comhionannais machnamh ar aon taifead coiriúil nó aon imeachtaí atá ag dul ar aghaidh faoi láthair sula gceadaítear eadóirseacht nó a mhalairt

source: Details of any proceedings, criminal or civil, in the State or elsewhere, should be disclosed in the application form, and
ga: Ba cheart sonraí faoi imeachtaí ar bith, coiriúil nó sibhialta, sa Stát nó in áit ar bith eile, a nochtadh ar an bhfoirm iarratais, agus

source: • Have had a period of 365 days* (1 year) continuous reckonable residence in the State immediately before the date of your application for naturalisation and, during the 8 years preceding that, have had a total reckonable residence in the State amounting to 1,460 days* (4 years)
ga: • Tréimhse cónaithe ináirithe leanúnach de 365 lá (bliain amháin) a bheith agat sa Stát díreach roimh dháta d'iarratas ar eadóirseacht agus, cónaí ináirithe iomlán sa Stát de 1,460 lá* (4 bliana) a bheith agat i rith na 8 mbliana roimhe sin

source: Altogether you must have 5 years (5 x 365 days*) reckonable residence out of the last 9 years - see ‘calculating reckonable residence’ below, and
ga: San iomlán, caithfidh tú 5 bliana (5 x 365 lá*) de chónaí ináirithe a bheith agat sna 9 mbliana seo caite - féach an t-alt thíos maidir le cónaí ináirithe a ríomh, agus

source: • Intend in good faith to continue to reside in the State after naturalisation and
ga: • Dea-rún a bheith agat leanúint ort ag cónaí sa Stát tar éis duit eadóirseacht a thabhairt amach

source: • Make a declaration of fidelity to the nation and loyalty to the State, and undertake to observe the laws of the State and respect its democratic values (see below for the point in the process at which this is required)
ga: • Dearbhú dílseachta a dhéanamh don náisiún agus don Stát agus a ghealladh na dlíthe Stáit a chomhlíonadh agus a luachanna daonlathacha a urramú (féach thíos le fáil amach cathain is gá seo a dhéanamh)

source: *You must add 1 day for any period which includes 29 February
ga: *Caithfidh tú cuir lá amháin le haon tréimhse lena n-áirítear 29 Feabhra

source: Normally, when you apply for naturalisation you must be supporting yourself and your dependants while living in Ireland - see 'Self supporting' below
ga: De ghnáth, nuair déanann tú iarratas ar eadóirseacht, caithfidh tú agus do chleithiúnaithe bheith féintacaithe agus sibh in bhur gcónaí in Éirinn - féach 'Féintacaithe' thíos

source: The Minister for Justice and Equality has power to waive one or more of the conditions for naturalisation in the following circumstances:
ga: Tá cumhacht ag an Aire Dlí agus Cirt agus Comhionannais aon cheann de na coinníollacha seo a tharscaoileadh sna himthosca a leanas:

source: • If you are of Irish descent or of Irish associations or are a parent or guardian applying on behalf of a minor child of Irish descent or Irish associations
ga: • Más de bhunadh Éireannach tú, má tá baint agat le hÉirinn nó más tuismitheoir nó caomhnóir tú atá ag déanamh iarratais thar ceann mionaoisigh de bhunadh na hÉireann nó a bhfuil baint aige le hÉirinn

source: • If you have an entitlement to Irish citizenship if you were born on the island of Ireland
ga: • Más rud é go raibh tú i dteideal bheith i do shaoránach Éireannach, má saolaíodh in oileán na hÉireann tú

source: • If you are a naturalised parent applying on behalf of a minor child
ga: • Más tuismitheoir eadóirsithe tú atá ag déanamh iarratais thar ceann mionaoisigh

source: • If you are the spouse or civil partner of an Irish citizen or a naturalised person
ga: • Más céile nó páirtnéir sibhialta saoránaigh de chuid na hÉireann tú nó duine eadóirsithe

source: • If you have been resident abroad in the public service
ga: • Más rud é go raibh cónaí ort thar lear sa tseirbhís phoiblí

source: • If you are recognised as a refugee (under the 1951 Geneva Convention relating to the Status of Refugees) or a stateless person (under the 1954 UN Convention regarding Stateless Persons)
ga: • Más rud é go n-aithnítear mar dhídeanaí tú (faoi Choinbhinsiún 1951 na Ginéive um Stádas Dídeanaithe) nó más duine gan stát tú (faoi Chonbhinsiún 1954 na Náisiún Aontaithe um Dhaoine gan Stát)

source: In the case of a refugee, stateless person or a person of Irish associations, the Minister will normally waive 2 of the 5 years' reckonable residence requirement
ga: Sa chás dídeanaí, duine gan stát ná duine le baint aige/aici le hÉirinn, tarscaoileann an tAire 2 den 5 bhliain tréimhse chónaithe inghlactha riachtanach de ghnáth

source: Reckonable residence means periods of residence taken into account when examining an application for naturalisation
ga: Clúdaíonn tréimhse chónaithe inghlactha tréimhsí cónaithe a chuirtear san áireamh nuair a scrúdaítear iarratas eadóirsithe

source: Certain periods of residence may be excluded from the reckoning when calculating periods of residence in the State
ga: B'fhéidir go mbeidh roinnt tréimhsí cónaithe fágtha as an áireamh nuair a mheastar tréimhsí cónaithe sa Stát

source: These are periods when your presence in the State was not properly documented or (in certain cases) periods covered by a permission to remain that was for study purposes or while having a claim for asylum examined
ga: Is iad seo tréimhsí nuair nach raibh cáipéisí faoin tréimhse a chaith tú sa Stát i gceart nó (i gcásanna áirithe) tréimhsí a clúdaíodh le cead a tugadh ar mhaithe le staidéar nó nuair a bhíothas ag scrúdú iarratais ar thearmann

source: You can use the online residency calculator on the INIS website to check if you meet the naturalisation residency conditions
ga: Is féidir an t-áireamhán cónaitheachta ar líne sa suíomh gréasáin SEIS a úsáid chun seiceáil an bhfuil na coinníollacha eadóirseachta cónaitheachta sásta

source: EEA nationals: The time that a EEA or Swiss citizen has spent in the State is reckonable for naturalisation purposes as EEA and Swiss citizens are not required to have residence permits or documents under the European Communities (Free Movement of Persons) Regulations 2015
ga: Cónaí inghlactha i gcomhair náisiúnach LEE: Tá an tréimhse atá caite ag saoránach de chuid an LEE nó na Sualainne sa Stát ináirithe chun críocha eadóirseachta os rud é nach gá do shaoránaigh de chuid an LEE agus na hEilvéise cáipéisí ná cead cónaithe a bheith acu faoi Rialacháin na gComhphobal Eorpach (Saorghluaiseacht Daoine) 2015

source: The European Economic Area (EEA) comprises the EU member states, Norway, Iceland and Liechtenstein
ga: Tá an Limistéar Eorpach Eacnamaíoch (LEE) comhdhéanta as ballstáit an AE, an Iorua, an Íoslainn agus Lichtinstéin

source: Non-EEA nationals: If you are not an EEA or Swiss citizen, any time when you did not have permission to remain in the State will not be counted as reckonable residence
ga: Cónaí inghlactha i gcomhair náisiúnach LEE: Muna bhfuil tú i do shaoránach de chuid an Aontais Eorpaigh, ní dhéantar tréimhse nuair a bhí iachall ort faoin dlí cead a bheith agat fanacht sa Stát ach nach raibh an cead sin agat, a chur san áireamh

source: Registration with immigration is the evidence of legal residence which meets the residency requirements for naturalisation
ga: Is clárú leis an oifig um inimirce é fianaise ar chead fanachta sa Stát a chomlíonann na riachtanais cónaithe maidir le eadóírseacht

source: The following periods of residence will not be reckoned if the permission to remain:
ga: Ní chuirtear tréimhsí cónaithe sa Stát san áireamh má tá an cead fanachta sin:

source: • Was for the purposes of study (that is, you were on a student visa) whether or not that study involved you being employed during any of the period of study, or
ga: • Ar mhaithe le staidéar (bíodh go raibh tú fostaithe nó gan a bheith ag aon am le linn an staidéir sin) nó

source: • Was granted while your claim for asylum was being examined, if the claim was not granted. Refugees
ga: • Tugtha fhad a bhíothas ag scrúdú d'iarratais ar thearmann

source: In general, apart from refugees and stateless persons, applicants for naturalisation must prove they can support themselves and their families while living in Ireland
ga: De ghnáth, seachas dídeanaithe agus daoine gan stát, caithfidh iarratasóirí ar eadóirseacht cruthú gur féidir leo iad féin agus a gcuid clann a thacú agus iad ina gcónaí in Éirinn

source: If you can show that you have not received State support in the 3 years before your application, this will generally meet the Minister for Justice and Equality's requirement that you have been supporting yourself and your dependants and that you will continue to do so
ga: Más féidir leat cruthú nach bhfaigheann tú tacaíocht Stáit ar feadh na 3 bhliain roimh d’iarratas, comhlíonfaidh tú riachtanas an Aire Dlí agus Cirt agus Comhionannais go bhfuil tú ag tacú tú féin agus do chleithiúnaithe agus go leanfaidh tú ar aghaidh é a dhéanamh

source: How your application for naturalisation is processed
ga: Conas a phróiseáltar d'iarratas ar eadóirseacht

source: You will normally be informed within a week whether your application has passed the initial processing stage
ga: De ghnáth, cuirfear fios duit laistigh de sheachtain an bhfuil d’iarratas ceadaithe san chéad chéim próiseáil

source: If your application passes the initial stage, it is then processed further along with all other applications that are on hand
ga: Má tá d’iarratas tríd an chéad chéim ceadaithe, próiseáiltar d'iarratas in ord cróineolaíoch leis na hiarratais ar fad eile atá idir lámha

source: You will be given a reference number and you should quote this number when making queries either by phone or in writing
ga: Tabharfar uimhir thagartha duit agus ba chóir duit seo a lua nuair a dhéanann tú fiosrúchán ar bith, bíodh sin ar an nguthán nó i gcló scríofa

source: For incorrect or incomplete applications, the process is longer, but you can keep it as short as possible by replying quickly to any queries
ga: Maidir le hiarratais atá mí-cheart nó mí-chruinn, tá próiseas níos faide i gceist ach is féidir leat é a choinneáil chomh gairid agus is féidir thrí fhreagra luath a thabhairt ar cheisteanna

source: If further documentation or clarification is needed, you will be asked for it once processing of your application has begun
ga: Má tá gá le tuilleadh cáipéisí nó soiléiriú, iarrfar sin ort chomh luath agus a thosaítear ag scrúdú d'iarratais

source: You will be informed by registered post as soon as a decision has been made on your application
ga: Cuirfear in iúl duit trí phost cláraithe chomh luath agus atá cinneadh déanta maidir le d'iarratas

source: Generally most applications will be processed within 6 months
ga: De ghnáth, beidh an chuid is mó iarratais próiseáilte laistigh 6 mhí

source: If your application is approved, the letter notifying you of this decision will contain instructions regarding the final procedures that must be completed before the certificate of naturalisation can be issued
ga: Má éiríonn le d'iarratas, beidh eolas sa litir a chuirfidh an cinneadh seo in iúl duit faoin bpróiseas deireanach a chaithfear a chríochnú sula n-eisítear an teastas eadóirseachta

source: When you submit the required documentation and certification fee, you will be invited to a citizenship ceremony at which you will be granted your certificate of naturalisation
ga: Nuair cuireann tú na cáipéisí riachtanacha agus táille dheimhniúcháin isteach, tabharfar cuireadh duit ar shearmanas saoránachta agus tabharfar duit do theastas eadóirseachta

source: You are an Irish citizen from the date of issue of the certificate and you can apply to the Department of Foreign Affairs and Trade for an Irish passport any time after that date
ga: Tá tú i do shaoránach Éireannach ó dháta eisiúint an teastais anuas agus is féidir leat iarratas a chur isteach do Roinn Gnóthaí Eachtracha agus Trádála i gcóir pas Éireannach ag am ar bith tar éis an dáta sin

source: The certificate of naturalisation is written in Irish
ga: Tá an teastas eadóirseacht scríofa i nGaeilge

source: The English version is Form 11 in the schedule of the Irish Nationality and Citizenship (Amendment) Regulations 2011
ga: Is an leagan Béarla é Foirm 11 sa sceideal na Rialacháin Náisiúntachta agus Saoránachta Éireann (Leasú) 2011

source: The Minister for Justice and Equality can revoke your certificate of naturalisation if:
ga: Is féidir leis an Aire Dlí agus Cirt agus Comhionannais do theastas eadóirseachta a chúlghairm más rud é:

source: • You obtained it through fraud, misrepresentation or concealment of material facts or circumstances
ga: • Go bhfuair tú é trí chalaois, mhífhaisnéis nó cheilt de fhíricí nó imthosca ábhartha

source: • You have, through an overt act, failed in your duty of fidelity to the nation and loyalty to the State
ga: • Gur theip ort, trí ghníomh follasach, i do dhualgas a bheith dílis don náisiún agus don Stát

source: • You were ordinarily resident outside Ireland (other than in public service) for a continuous period of 7 years and, without a reasonable excuse, did not register your name and a declaration of your intention to retain Irish citizenship with an Irish diplomatic mission or consular office or with the Minister for Justice and Equality on an annual basis - see 'How to apply' below
ga: • Go raibh cónaí ort go hiondúil taobh amuigh d'Éirinn (seachas i seirbhís phoiblí) ar feadh tréimhse leanúnaí seacht mbliana agus, gan leiscéal réasúnta, nár chláraigh tú d'ainm agus do dhearbhú go raibh tú chun do shaoránacht Éireannach a choinneáil le misiún taidhleoireachta nó oifig chonslachta Éireannach nó leis an Aire Dlí agus Cirt, Comhionnanais agus Comhionannais ar bhonn bliantúil - féach 'Conas iarratas a dhéanamh' thíos

source: • You are also, under the law of a country at war with the State, a citizen of that country
ga: • Go bhfuil tú, faoi dhlí tíre atá i mbun cogaidh leis an Stát, i do shaoránach de chuid na tíre sin

source: • You have, by any other voluntary act other than marriage or registration of civil partnership, acquired citizenship of another country
ga: • Go bhfuair tú, trí aon ghníomh deonach eile seachas pósadh nó páirtnéireacht sibhialta a chlárú saoránacht tíre eile

source: Before revoking your certificate of naturalisation, the Minister for Justice and Equality will inform you in advance, stating the reasons why the certificate is being revoked and your right to apply to the Minister for an inquiry into the reasons for the revocation
ga: Sula ndéanann an tAire Dlí agus Cirt agus Comhionannais, do theastas eadóirseachta a chúlghairm, cuirfear in iúl duit roimh ré, ag cur na fáthanna in iúl a bhfuiltear á chúlghairm agus faoin gceart a bheidh agat iarratas a dhéanamh don Aire chun fiosrúchán a reachtáil faoi fháth a chúlghairme

source: If you apply for an inquiry into a decision to revoke your certificate of naturalisation, the Minister will refer your case to a Committee of Inquiry, which will report its findings to the Minister
ga: Má chuireann tú isteach ar fhiosrúchán faoi chinneadh chúlghairm do theastais eadóirseachta , cuirfidh an tAire do chúis faoi bhráid Choiste Fiosrúcháin, a thabharfaidh tuairisc don Aire

source: A notice of the revocation of your certificate of naturalisation will be published in Iris Oifigiúil (Ireland's official State Gazette)
ga: Foilseofar fógra faoi chúlghairm do theastais eadóirseachta in Iris Oifigiúil

source: The fee for each application for naturalisation is €175
ga: Is é €175 an táille do gach iarratas ar eadóirseacht

source: The following are the relevant fees to be paid when the certificate of naturalisation is issued
ga: Is iad seo na táillí cuí nuair a n-eisítear an teastas eadóirseachta

source: Application on behalf of a minor €200
ga: Iarratas thar ceann mionaoisigh €200

source: Widow, widower or surviving civil partner of Irish citizen €200
ga: Baintreach, baintreach fir nó páirtnéir sibhialta marthanach saoránaigh Éireannaigh €200

source: Refugee, stateless person or programme refugee No charge
ga: Dídeanaí, duine gan stát nó clárdhídeanaí Gan táille

source: You must use the current versions of the application forms on the INIS website
ga: Caithfidh tú an leagan reatha na foirmeacha iarratais ar an suíomh gréasáin SÉIS a úsáid

source: The current application forms are:
ga: Seo na foirmeacha iarratais reatha:

source: • Form 8 (pdf) for a person aged 18 or over
ga: • Foirm 8 (pdf) le haghaidh duine lánfhásta

source: • Form 9 (pdf) for the minor child of a naturalised Irish citizen
ga: • Foirm 9 (pdf) le haghaidh mionaoisigh saoránaigh eadóirsithe Éireannaigh

source: • Form 10 (pdf), an electronic form which should be completed online by parents of a minor child of Irish descent or Irish associations
ga: • Foirm 10 (pdf), foirm leictreonach ba ghá do thuismitheoir/caomhnóir mionaosaigh, de bhunadh Éireannach nó a bhfuil baint aige le hÉirinn, í ar líne a chomhlánú

source: There is a guidance note on how to complete form 10 (pdf)
ga: Tá treoirnóta maidir le conas foirm 10 a chomhlánú (pdf)

source: • Form 11 (pdf), an electronic form which should be completed online by a parent/guardian of a minor child born in the State who was not entitled to Irish citizenship at birth
ga: • Foirm 11 (pdf), foirm leictreonach ba ghá do thuismitheoir/caomhnóir mionaosaigh a rugadh in Éirinn í nach bhfuil i dteideal saoránacht Éireannach nuair rugadh é/í, ar líne a chomhlánú

source: The child must be at least 5 years of age when the application is made
ga: Ní mór don mionaosaigh bheith 5 bliana d’aois ar a laghad nuair déantar an t-iarratas

source: The parent/guardian must have 5 years' reckonable residence since the birth of the child, including the full year immediately prior to the date of application
ga: Caithfidh an tuismitheoir/caomhnóir 5 bliana de chónaí ináirithe ó bhreith an leanbh a bheith acu, lena n-áirítear an bhliain iomlán díreach roimh dháta iarratas

source: There is a guidance note on how to complete form 11 (pdf)
ga: Tá treoirnóta maidir le conas foirm 11 a chomhlánú (pdf)

source: • Form 5 (pdf), annual registration form and declaration of intention to retain Irish citizenship for a naturalised Irish citizen resident outside Ireland
ga: • Foirm 5 (pdf), foirm clárúcháin bhliantúil agus dearbhú intinne chun saoránacht Éireannach a choinneáil do shaoránach eadóirsithe Éireannach atá ina chónaí taobh amuigh d’Éire

source: You can find more information about Irish citizenship and naturalisation on the INIS website
ga: Tá tuilleadh faisnéise maidir le saoránacht agus eadóirseacht ar fáil ar an suíomh gréasáin SEIS

source: The supporting documents required depend on your situation; you will need to provide evidence of your identity and nationality (long-form birth certificate and passport)
ga: I measc na gcáipéisí eile atá ag teastáil, tá fianaise d'aitheantais agus do náisiúnachta (teastas breithe sa bhfoirm fhada agus pas)

source: Allow at least 4 weeks for your passport to be returned to you. Since 19 September 2016, if you are resident in the State, you must be registered for a Public Services Card (PSC) and you must include a copy of your PSC with your application form
ga: Ó 19 Meán Fómhair 2016, má tá tú i do chónaí sa Stát, caithfidh tú bheith cláraithe do Chárta Seirbhísí Poiblí (CSP) agus caithfidh tú cóip do CSP a chur isteach le d’fhoirm iarratais

source: You also need to produce documents relating to your status and the duration of your stay in the State (Certificate of Registration, declaration of refugee status, or the like)
ga: Caithfidh tú freisin cáipéisí a thaispeáint maidir le do stádas agus faoin tréimhse a bheidh tú ag stopadh sa Stát (teastas clárúcháin, ráiteas faoi stádas dídeanaí nó a leithéid)

source: If you are a non-EEA national applying for naturalisation your residency stamps are the only evidence which provide proof of your reckonable residence
ga: Más náisiúnach neamh-LEE thú agus ag iarraidh ar shaorántacht, níl ach do stampaí cónaitheachta amháin an cruthúnas do thréimhse chónaithe inghlactha
